9/data/attachments/9368d17b58ec6dc.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7dee3b1c-3d37-4833-a528-95acda82439a</nif:username>
            <nif:friendToBeAdded>Michelle_clearly_Friend_9488_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>